Revit 2027 API
GroupTypeId.AnalyticalProperties Property
 Analytical Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalProperties { get; }
Public Shared ReadOnly Property AnalyticalProperties As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalProperties {
	ForgeTypeId^ get ();
}
static member AnalyticalProperties : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace